sec_name, first_name = 'Микеладзе', 'Тимур'
work_time = '3 года 2 месяца,'
job_title = 'инженер-тестировщик 2 категории'
company = 'Тензор'
purpose1 = 'деньги'
need = 'мотивация'
dignity1 = 'Стрессоустойчивость'
dignity2 = 'Коммуникабельность'
dignity3 = 'Обучаемость'
flaw1 = 'Безынициативность'
flaw2 = 'Имитация бурной деятельности'
flaw3 = 'Некомпанейскость'
vacancy = 'машинист-слесарь 3 разряда'

print('Привет, меня зовут', sec_name, first_name)
print('Я работаю в компании', company, work_time, 'моя специальность -', job_title)
print('В рабочем процессе для меня главное -', purpose1, 'т.к. для достижения целей мне необходима', need)
print('Как и всем людям, кто отправляет вам резюме, мне присущи такие качества как:')
print('1.', dignity1)
print('2.', dignity2)
print('3.', dignity3)
print('А также как и у многих людей в офисной среде у меня есть недостатки:')
print('1.', flaw1)
print('2.', flaw2)
print('3.', flaw3)
print('Я готов работать не больше, чем остальные, и не меньше, чем остальные, большего от меня не ждите')
print('Прошу вас рассмотреть мою кандидатуру на позицию', vacancy)
